Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>pl-strflt</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_issue_label.this["github-mgmt:bug"] will be destroyed
  # (because key ["github-mgmt:bug"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "d73a4a" -> null
      - description = "Something isn't working" -> null
      - etag        = "W/\"819e2e7c633768170ee77d938e1da4f31c0b1aafaf577a34aff8835f7b5c1f96\"" -> null
      - id          = "github-mgmt:bug" -> null
      - name        = "bug" -> null
      - repository  = "github-mgmt" -> null
      - url         = "https://api.github.com/repos/pl-strflt/github-mgmt/labels/bug" -> null
    }

  # github_issue_label.this["github-mgmt:dependencies"] will be destroyed
  # (because key ["github-mgmt:dependencies"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "0366d6" -> null
      - description = "Pull requests that update a dependency file" -> null
      - etag        = "W/\"ec36e29c1adc9a343d807f38e4ed2f265c4ac70e7168bf38414fb77b17ab72c2\"" -> null
      - id          = "github-mgmt:dependencies" -> null
      - name        = "dependencies" -> null
      - repository  = "github-mgmt" -> null
      - url         = "https://api.github.com/repos/pl-strflt/github-mgmt/labels/dependencies" -> null
    }

  # github_issue_label.this["github-mgmt:documentation"] will be destroyed
  # (because key ["github-mgmt:documentation"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "0075ca" -> null
      - description = "Improvements or additions to documentation" -> null
      - etag        = "W/\"b1315633a3a2e4199ae17fd37e89939f1f2a85de3959a501b3bca8525da441aa\"" -> null
      - id          = "github-mgmt:documentation" -> null
      - name        = "documentation" -> null
      - repository  = "github-mgmt" -> null
      - url         = "https://api.github.com/repos/pl-strflt/github-mgmt/labels/documentation" -> null
    }

  # github_issue_label.this["github-mgmt:duplicate"] will be updated in-place
  ~ resource "github_issue_label" "this" {
      ~ description = "This issue or pull request already exists" -> "This issue or pull request already exists 🙀"
        id          = "github-mgmt:duplicate"
        name        = "duplicate"
        # (4 unchanged attributes hidden)
    }

  # github_issue_label.this["github-mgmt:enhancement"] will be destroyed
  # (because key ["github-mgmt:enhancement"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "a2eeef" -> null
      - description = "New feature or request" -> null
      - etag        = "W/\"2cc09d82afb6b9a2387b45c5f2b3ba083791ba0bdee07cbc5f7905147f57cc1a\"" -> null
      - id          = "github-mgmt:enhancement" -> null
      - name        = "enhancement" -> null
      - repository  = "github-mgmt" -> null
      - url         = "https://api.github.com/repos/pl-strflt/github-mgmt/labels/enhancement" -> null
    }

  # github_issue_label.this["github-mgmt:good first issue"] will be destroyed
  # (because key ["github-mgmt:good first issue"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "7057ff" -> null
      - description = "Good for newcomers" -> null
      - etag        = "W/\"5eb061b2e888f5d7b37f88fd481cae1e84ff6005f5903d1d9e2af681ed15290f\"" -> null
      - id          = "github-mgmt:good first issue" -> null
      - name        = "good first issue" -> null
      - repository  = "github-mgmt" -> null
      - url         = "https://api.github.com/repos/pl-strflt/github-mgmt/labels/good%20first%20issue" -> null
    }

  # github_issue_label.this["github-mgmt:help wanted"] will be destroyed
  # (because key ["github-mgmt:help wanted"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "008672" -> null
      - description = "Extra attention is needed" -> null
      - etag        = "W/\"2b64b8f13ab1de1f907e8fd03b3dbab37b20995d97b7cf0d23f790d2fc2670be\"" -> null
      - id          = "github-mgmt:help wanted" -> null
      - name        = "help wanted" -> null
      - repository  = "github-mgmt" -> null
      - url         = "https://api.github.com/repos/pl-strflt/github-mgmt/labels/help%20wanted" -> null
    }

  # github_issue_label.this["github-mgmt:invalid"] will be destroyed
  # (because key ["github-mgmt:invalid"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "e4e669" -> null
      - description = "This doesn't seem right" -> null
      - etag        = "W/\"b10a4e4bde8cfd79ae04ce7ed58c10bdf3022147f68a83d7a2d8f9e92773f45e\"" -> null
      - id          = "github-mgmt:invalid" -> null
      - name        = "invalid" -> null
      - repository  = "github-mgmt" -> null
      - url         = "https://api.github.com/repos/pl-strflt/github-mgmt/labels/invalid" -> null
    }

  # github_issue_label.this["github-mgmt:javascript"] will be destroyed
  # (because key ["github-mgmt:javascript"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "168700" -> null
      - description = "Pull requests that update Javascript code" -> null
      - etag        = "W/\"fcac94bf825f98482fc45afcb8d2800ce6e0dc1f6f7ac3e7cac7f9d35119123b\"" -> null
      - id          = "github-mgmt:javascript" -> null
      - name        = "javascript" -> null
      - repository  = "github-mgmt" -> null
      - url         = "https://api.github.com/repos/pl-strflt/github-mgmt/labels/javascript" -> null
    }

  # github_issue_label.this["github-mgmt:question"] will be destroyed
  # (because key ["github-mgmt:question"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "d876e3" -> null
      - description = "Further information is requested" -> null
      - etag        = "W/\"ae6e7724640d7982c84d80cd56d761e0d7911d95a1f546159d20278f93a08b1e\"" -> null
      - id          = "github-mgmt:question" -> null
      - name        = "question" -> null
      - repository  = "github-mgmt" -> null
      - url         = "https://api.github.com/repos/pl-strflt/github-mgmt/labels/question" -> null
    }

  # github_issue_label.this["github-mgmt:test 🧪"] will be created
  + resource "github_issue_label" "this" {
      + color       = "e123a2"
      + description = "This issue or pull request relates to tests only"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "test 🧪"
      + repository  = "github-mgmt"
      + url         = (known after apply)
    }

  # github_issue_label.this["github-mgmt:wontfix"] will be destroyed
  # (because key ["github-mgmt:wontfix"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "ffffff" -> null
      - description = "This will not be worked on" -> null
      - etag        = "W/\"c62c22e978d55efbbf7a85d84fa082269da92fb1ed67161f7d233cc565dd91b8\"" -> null
      - id          = "github-mgmt:wontfix" -> null
      - name        = "wontfix" -> null
      - repository  = "github-mgmt" -> null
      - url         = "https://api.github.com/repos/pl-strflt/github-mgmt/labels/wontfix" -> null
    }

  # github_issue_label.this["github-mgmt:💀 wontfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "fffffe"
      + description = "This will not be worked on 💀"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "💀 wontfix"
      + repository  = "github-mgmt"
      + url         = (known after apply)
    }

Plan: 2 to add, 1 to change, 10 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->